Config/Catalogs/ПараметрыДоговораДляЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПараметрыДоговораДляЭДО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Comment>Дата окончания действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеПролонгации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияЭД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПереходаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкотермс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИныеСведенияОбУсловияхПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПлатежей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеНачалаОтсчетаСрокаОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредметДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакПредмета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКаталога</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>27</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОКВЭД2</Name>
							<Comment>Код по классификатору видов экономической деятельности</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСделки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеТРУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАкциза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Госуслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блюдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>Горюче-смазочные материалы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолоднякИЖивотныеНаОткорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МягкийИнвентарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Посуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПитания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стройматериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиологическиеАктивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ПараметрыДоговораДляЭДО/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		Если Параметры.Свойство("Договор") Тогда
			Объект.Договор = Параметры.Договор;
			
			ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Договор, "Организация, Контрагент, РазделЛицевогоСчета,
				|СчетКонтрагента, Наименование, ВалютаНоминала");
			Объект.Организация = ДанныеДокумента.Организация;
			Объект.Контрагент = ДанныеДокумента.Контрагент;
			Объект.Наименование = ДанныеДокумента.Наименование;
			Объект.ВалютаДоговора = ДанныеДокумента.ВалютаНоминала;
			Объект.ВалютаРасчетов = ДанныеДокумента.ВалютаНоминала;
			Объект.РеквизитыЛицевогоСчета = ДанныеДокумента.РазделЛицевогоСчета;
			Объект.РасчетныйСчетКонтрагента = ДанныеДокумента.СчетКонтрагента;
			Если ЗначениеЗаполнено(ДанныеДокумента.РазделЛицевогоСчета) Тогда
				ДанныеРазделаЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокумента.РазделЛицевогоСчета, "Владелец");
				Объект.ЛицевойСчет = ДанныеРазделаЛицевогоСчета.Владелец;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДоговора) Тогда
		Объект.ВалютаДоговора = ВалютаРегУчета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаРасчетов) Тогда
		Объект.ВалютаРасчетов = ВалютаРегУчета;
	КонецЕсли;
	
	ОбновитьЗаголовокПредмета();
	
	ВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = НаименованиеДанныхПараметровЭДОДоговора();
	КонецЕсли;
	Если НЕ Объект.ВходящийЭД Тогда
		Объект.СуммаНДС = Объект.ПредметДоговора.Итог("СуммаНДС");
		Если Объект.ПредметДоговора.Итог("Всего") > 0 Тогда
			Если Объект.Сумма <> Объект.ПредметДоговора.Итог("Всего") Тогда
				Отказ = Истина;
				
				ШаблонТекстСообщения  = НСтр("ru='Сумма договора на закладке ""Основные"" %1 
					|не равна общей стоимости в списке товаров, работ, услуг на закладке ""Предмет договора"" %2!'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстСообщения, 
					Объект.Сумма, Объект.ПредметДоговора.Итог("Всего"));
				ПоказатьПредупреждение(Неопределено, ТекстСообщения);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОбновитьЗаголовокПредмета();

	Оповестить("Запись_ПараметрыДоговораДляЭДО", ПараметрыЗаписи, Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПредметДоговора

&НаКлиенте
Процедура ПредметДоговораКоличествоПриИзменении(Элемент)
	СуммаВключаетНДС = Истина;
	ТекущиеДанные = Элементы.ПредметДоговора.ТекущиеДанные;
	РассчитатьСтроку(Элементы.ПредметДоговора.ТекущиеДанные, СуммаВключаетНДС, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ПредметДоговораЦенаПриИзменении(Элемент)
	СуммаВключаетНДС = Истина;
	ТекущиеДанные = Элементы.ПредметДоговора.ТекущиеДанные;
	РассчитатьСтроку(Элементы.ПредметДоговора.ТекущиеДанные, СуммаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ПредметДоговораСтавкаНДСПриИзменении(Элемент)
	СуммаВключаетНДС = Истина;
	РассчитатьСтроку(Элементы.ПредметДоговора.ТекущиеДанные, СуммаВключаетНДС, "СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ПредметДоговораСуммаНДСПриИзменении(Элемент)
	СуммаВключаетНДС = Истина;
	РассчитатьСтроку(Элементы.ПредметДоговора.ТекущиеДанные, СуммаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ПредметДоговораНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПредметДоговора.ТекущиеДанные;
	ДанныеНоменклатурыОрганизацииСтроки = ДанныеНоменклатурыОрганизацииСтроки(Объект.Организация, ТекущиеДанные.Номенклатура);
	ТекущиеДанные.ПризнакПредмета = ДанныеНоменклатурыОрганизацииСтроки.ПризнакПредмета;
	ТекущиеДанные.ВидСделки = ДанныеНоменклатурыОрганизацииСтроки.ВидСделки;
	ТекущиеДанные.КодОКВЭД2 = ДанныеНоменклатурыОрганизацииСтроки.КодОКВЭД2;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериодДоговора(Команда)
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",	Объект["ДатаНачалаДействия"]);
	СтруктураПараметров.Вставить("КонецПериода",	Объект["ДатаОкончанияДействия"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НаименованиеДанныхПараметровЭДОДоговора() Экспорт
	Результат = "";
		
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "Наименование");
	Результат = ДанныеДокумента.Наименование;

	Возврат Результат;	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьЭлементовФормы(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоВходящийДокумент = Ложь;
	Если Объект.ВходящийЭД Тогда
		ЭтоВходящийДокумент = Истина;
	КонецЕсли;
	УчитыватьНДСВоВходящем = Объект.СуммаНДС > 0;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаНДС", "Видимость", ЭтоВходящийДокумент И УчитыватьНДСВоВходящем);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораНоменклатура", "Видимость", НЕ ЭтоВходящийДокумент);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораВалютаКод", "Видимость", ЭтоВходящийДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораКодКаталога", "Видимость", ЭтоВходящийДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораКодТНВЭД", "Видимость", ЭтоВходящийДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораОКП", "Видимость", ЭтоВходящийДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораНаименованиеТРУ", "Видимость", ЭтоВходящийДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораЕдиницаИзмеренияКод", "Видимость", ЭтоВходящийДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораЕдиницаИзмеренияКод", "Видимость", ЭтоВходящийДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредметДоговораЕдиницаИзмеренияКод", "Видимость", ЭтоВходящийДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["ДатаНачалаДействия"]	= РезультатВыбора["НачалоПериода"];
		Объект["ДатаОкончанияДействия"]	= РезультатВыбора["КонецПериода"];
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокПредмета()
	ЗаголовокПредметаДоговора = "";
	Всего = Объект.ПредметДоговора.Итог("Всего");
	
	Если Всего > 0 Тогда
		ШаблонЗначения = НСтр("ru = '%1 %2'");
		
		Если ЗначениеЗаполнено(Объект.СуммаНДС) Тогда
			ШаблонЗначения = НСтр("ru = '%1 %2, в т.ч. НДС %3'");
		КонецЕсли;
		ЗаголовокПредметаДоговора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗначения, 
			Всего, Объект.ВалютаДоговора, Объект.ПредметДоговора.Итог("СуммаНДС"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДанныеНоменклатурыОрганизацииСтроки(Организация, Номенклатура)
	Результат = Новый Структура;
	ПризнакПредмета = НСтр("ru='4'");
	ВидСделки = НСтр("ru='24'");
	
	ЗначенияРеквизитовОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "КодОКВЭД2");
	КодОКВЭД2 = СокрЛП(ЗначенияРеквизитовОрганизации.КодОКВЭД2);

	Если ЗначениеЗаполнено(Номенклатура) Тогда
		РаботыУслуги = ЭлектронныеДокументыБГУ.ТипыНоменклатурыУслугРабот();
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			ПризнакПредмета = НСтр("ru='1'");
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ТипНоменклатуры");
			ТипНоменклатуры = ЗначенияРеквизитов.ТипНоменклатуры;
			Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
				ПризнакПредмета = НСтр("ru='2'");
			ИначеЕсли ЗначениеЗаполнено(РаботыУслуги.Найти(ТипНоменклатуры)) Тогда
				ПризнакПредмета = НСтр("ru='3'");
			КонецЕсли;
		ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ПризнакПредмета = НСтр("ru='1'");
			ВидСделки = НСтр("ru='16'");
		КонецЕсли;
	КонецЕсли;
	
	Результат.Вставить("КодОКВЭД2", КодОКВЭД2);
	Результат.Вставить("ПризнакПредмета", ПризнакПредмета);
	Результат.Вставить("ВидСделки", ВидСделки);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
